luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxSbcu_bf.h
/** \brief  Length for Ifx_SBCU_DBCNTL_Bits.ONBOS3 */
#define IFX_SBCU_DBCNTL_ONBOS3_LEN (1u)

/** \brief  Mask for Ifx_SBCU_DBCNTL_Bits.ONBOS3 */
#define IFX_SBCU_DBCNTL_ONBOS3_MSK (0x1u)

/** \brief  Offset for Ifx_SBCU_DBCNTL_Bits.ONBOS3 */
#define IFX_SBCU_DBCNTL_ONBOS3_OFF (31u)

/** \brief  Length for Ifx_SBCU_DBCNTL_Bits.ONG */
#define IFX_SBCU_DBCNTL_ONG_LEN (1u)

/** \brief  Mask for Ifx_SBCU_DBCNTL_Bits.ONG */
#define IFX_SBCU_DBCNTL_ONG_MSK (0x1u)

/** \brief  Offset for Ifx_SBCU_DBCNTL_Bits.ONG */
#define IFX_SBCU_DBCNTL_ONG_OFF (16u)

/** \brief  Length for Ifx_SBCU_DBCNTL_Bits.RA */
#define IFX_SBCU_DBCNTL_RA_LEN (1u)

/** \brief  Mask for Ifx_SBCU_DBCNTL_Bits.RA */
#define IFX_SBCU_DBCNTL_RA_MSK (0x1u)

/** \brief  Offset for Ifx_SBCU_DBCNTL_Bits.RA */
#define IFX_SBCU_DBCNTL_RA_OFF (4u)

/** \brief  Length for Ifx_SBCU_DBDAT_Bits.FPIDATA */
#define IFX_SBCU_DBDAT_FPIDATA_LEN (32u)

/** \brief  Mask for Ifx_SBCU_DBDAT_Bits.FPIDATA */
#define IFX_SBCU_DBDAT_FPIDATA_MSK (0xffffffffu)

/** \brief  Offset for Ifx_SBCU_DBDAT_Bits.FPIDATA */
#define IFX_SBCU_DBDAT_FPIDATA_OFF (0u)

/** \brief  Length for Ifx_SBCU_DBGNTT_Bits.CPU0 */
#define IFX_SBCU_DBGNTT_CPU0_LEN (1u)

/** \brief  Mask for Ifx_SBCU_DBGNTT_Bits.CPU0 */
#define IFX_SBCU_DBGNTT_CPU0_MSK (0x1u)

/** \brief  Offset for Ifx_SBCU_DBGNTT_Bits.CPU0 */
#define IFX_SBCU_DBGNTT_CPU0_OFF (7u)

/** \brief  Length for Ifx_SBCU_DBGNTT_Bits.CPU1 */
#define IFX_SBCU_DBGNTT_CPU1_LEN (1u)

/** \brief  Mask for Ifx_SBCU_DBGNTT_Bits.CPU1 */
#define IFX_SBCU_DBGNTT_CPU1_MSK (0x1u)

/** \brief  Offset for Ifx_SBCU_DBGNTT_Bits.CPU1 */
#define IFX_SBCU_DBGNTT_CPU1_OFF (8u)

/** \brief  Length for Ifx_SBCU_DBGNTT_Bits.CPU2 */
#define IFX_SBCU_DBGNTT_CPU2_LEN (1u)

/** \brief  Mask for Ifx_SBCU_DBGNTT_Bits.CPU2 */
#define IFX_SBCU_DBGNTT_CPU2_MSK (0x1u)

/** \brief  Offset for Ifx_SBCU_DBGNTT_Bits.CPU2 */
#define IFX_SBCU_DBGNTT_CPU2_OFF (9u)

/** \brief  Length for Ifx_SBCU_DBGNTT_Bits.DMACHNR */
#define IFX_SBCU_DBGNTT_DMACHNR_LEN (8u)

/** \brief  Mask for Ifx_SBCU_DBGNTT_Bits.DMACHNR */
#define IFX_SBCU_DBGNTT_DMACHNR_MSK (0xffu)

/** \brief  Offset for Ifx_SBCU_DBGNTT_Bits.DMACHNR */
#define IFX_SBCU_DBGNTT_DMACHNR_OFF (16u)

/** \brief  Length for Ifx_SBCU_DBGNTT_Bits.DMAH */
#define IFX_SBCU_DBGNTT_DMAH_LEN (1u)

/** \brief  Mask for Ifx_SBCU_DBGNTT_Bits.DMAH */
#define IFX_SBCU_DBGNTT_DMAH_MSK (0x1u)

/** \brief  Offset for Ifx_SBCU_DBGNTT_Bits.DMAH */
#define IFX_SBCU_DBGNTT_DMAH_OFF (0u)

/** \brief  Length for Ifx_SBCU_DBGNTT_Bits.DMAL */
#define IFX_SBCU_DBGNTT_DMAL_LEN (1u)

/** \brief  Mask for Ifx_SBCU_DBGNTT_Bits.DMAL */
#define IFX_SBCU_DBGNTT_DMAL_MSK (0x1u)

/** \brief  Offset for Ifx_SBCU_DBGNTT_Bits.DMAL */
#define IFX_SBCU_DBGNTT_DMAL_OFF (15u)

/** \brief  Length for Ifx_SBCU_DBGNTT_Bits.DMAM */
#define IFX_SBCU_DBGNTT_DMAM_LEN (1u)

/** \brief  Mask for Ifx_SBCU_DBGNTT_Bits.DMAM */
#define IFX_SBCU_DBGNTT_DMAM_MSK (0x1u)

/** \brief  Offset for Ifx_SBCU_DBGNTT_Bits.DMAM */
#define IFX_SBCU_DBGNTT_DMAM_OFF (5u)

/** \brief  Length for Ifx_SBCU_DBGNTT_Bits.ETH */
#define IFX_SBCU_DBGNTT_ETH_LEN (1u)

/** \brief  Mask for Ifx_SBCU_DBGNTT_Bits.ETH */
#define IFX_SBCU_DBGNTT_ETH_MSK (0x1u)

/** \brief  Offset for Ifx_SBCU_DBGNTT_Bits.ETH */
#define IFX_SBCU_DBGNTT_ETH_OFF (2u)

/** \brief  Length for Ifx_SBCU_DBGNTT_Bits.HSMCMI */
#define IFX_SBCU_DBGNTT_HSMCMI_LEN (1u)

/** \brief  Mask for Ifx_SBCU_DBGNTT_Bits.HSMCMI */
#define IFX_SBCU_DBGNTT_HSMCMI_MSK (0x1u)

/** \brief  Offset for Ifx_SBCU_DBGNTT_Bits.HSMCMI */
#define IFX_SBCU_DBGNTT_HSMCMI_OFF (13u)

/** \brief  Length for Ifx_SBCU_DBGNTT_Bits.HSMRMI */
#define IFX_SBCU_DBGNTT_HSMRMI_LEN (1u)

/** \brief  Mask for Ifx_SBCU_DBGNTT_Bits.HSMRMI */
#define IFX_SBCU_DBGNTT_HSMRMI_MSK (0x1u)

/** \brief  Offset for Ifx_SBCU_DBGNTT_Bits.HSMRMI */
#define IFX_SBCU_DBGNTT_HSMRMI_OFF (12u)

/** \brief  Length for Ifx_SBCU_DBGNTT_Bits.HSSL */
#define IFX_SBCU_DBGNTT_HSSL_LEN (1u)

/** \brief  Mask for Ifx_SBCU_DBGNTT_Bits.HSSL */
#define IFX_SBCU_DBGNTT_HSSL_MSK (0x1u)

/** \brief  Offset for Ifx_SBCU_DBGNTT_Bits.HSSL */
#define IFX_SBCU_DBGNTT_HSSL_OFF (3u)

/** \brief  Length for Ifx_SBCU_DBGNTT_Bits.ONE0 */
#define IFX_SBCU_DBGNTT_ONE0_LEN (1u)

/** \brief  Mask for Ifx_SBCU_DBGNTT_Bits.ONE0 */
#define IFX_SBCU_DBGNTT_ONE0_MSK (0x1u)

/** \brief  Offset for Ifx_SBCU_DBGNTT_Bits.ONE0 */
#define IFX_SBCU_DBGNTT_ONE0_OFF (1u)

/** \brief  Length for Ifx_SBCU_DBGNTT_Bits.ONE1 */
#define IFX_SBCU_DBGNTT_ONE1_LEN (1u)

/** \brief  Mask for Ifx_SBCU_DBGNTT_Bits.ONE1 */
#define IFX_SBCU_DBGNTT_ONE1_MSK (0x1u)

/** \brief  Offset for Ifx_SBCU_DBGNTT_Bits.ONE1 */
#define IFX_SBCU_DBGNTT_ONE1_OFF (4u)

/** \brief  Length for Ifx_SBCU_DBGNTT_Bits.ONE2 */
#define IFX_SBCU_DBGNTT_ONE2_LEN (1u)

/** \brief  Mask for Ifx_SBCU_DBGNTT_Bits.ONE2 */
#define IFX_SBCU_DBGNTT_ONE2_MSK (0x1u)

/** \brief  Offset for Ifx_SBCU_DBGNTT_Bits.ONE2 */
#define IFX_SBCU_DBGNTT_ONE2_OFF (6u)

/** \brief  Length for Ifx_SBCU_DBGNTT_Bits.ONE3 */
#define IFX_SBCU_DBGNTT_ONE3_LEN (2u)

/** \brief  Mask for Ifx_SBCU_DBGNTT_Bits.ONE3 */
#define IFX_SBCU_DBGNTT_ONE3_MSK (0x3u)

/** \brief  Offset for Ifx_SBCU_DBGNTT_Bits.ONE3 */
#define IFX_SBCU_DBGNTT_ONE3_OFF (10u)

/** \brief  Length for Ifx_SBCU_DBGNTT_Bits.ONE4 */
#define IFX_SBCU_DBGNTT_ONE4_LEN (1u)

/** \brief  Mask for Ifx_SBCU_DBGNTT_Bits.ONE4 */
#define IFX_SBCU_DBGNTT_ONE4_MSK (0x1u)

/** \brief  Offset for Ifx_SBCU_DBGNTT_Bits.ONE4 */
#define IFX_SBCU_DBGNTT_ONE4_OFF (14u)

/** \brief  Length for Ifx_SBCU_DBGNTT_Bits.ONE5 */
#define IFX_SBCU_DBGNTT_ONE5_LEN (8u)

/** \brief  Mask for Ifx_SBCU_DBGNTT_Bits.ONE5 */
#define IFX_SBCU_DBGNTT_ONE5_MSK (0xffu)

/** \brief  Offset for Ifx_SBCU_DBGNTT_Bits.ONE5 */
#define IFX_SBCU_DBGNTT_ONE5_OFF (24u)

/** \brief  Length for Ifx_SBCU_DBGRNT_Bits.CPU0 */
#define IFX_SBCU_DBGRNT_CPU0_LEN (1u)

/** \brief  Mask for Ifx_SBCU_DBGRNT_Bits.CPU0 */
#define IFX_SBCU_DBGRNT_CPU0_MSK (0x1u)

/** \brief  Offset for Ifx_SBCU_DBGRNT_Bits.CPU0 */
#define IFX_SBCU_DBGRNT_CPU0_OFF (7u)

/** \brief  Length for Ifx_SBCU_DBGRNT_Bits.CPU1 */
#define IFX_SBCU_DBGRNT_CPU1_LEN (1u)

/** \brief  Mask for Ifx_SBCU_DBGRNT_Bits.CPU1 */
#define IFX_SBCU_DBGRNT_CPU1_MSK (0x1u)

/** \brief  Offset for Ifx_SBCU_DBGRNT_Bits.CPU1 */
#define IFX_SBCU_DBGRNT_CPU1_OFF (8u)

