luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxSbcu_bf.h
/** \brief  Mask for Ifx_SBCU_ECON_Bits.WRN */
#define IFX_SBCU_ECON_WRN_MSK (0x1u)

/** \brief  Offset for Ifx_SBCU_ECON_Bits.WRN */
#define IFX_SBCU_ECON_WRN_OFF (20u)

/** \brief  Length for Ifx_SBCU_EDAT_Bits.FPIDAT */
#define IFX_SBCU_EDAT_FPIDAT_LEN (32u)

/** \brief  Mask for Ifx_SBCU_EDAT_Bits.FPIDAT */
#define IFX_SBCU_EDAT_FPIDAT_MSK (0xffffffffu)

/** \brief  Offset for Ifx_SBCU_EDAT_Bits.FPIDAT */
#define IFX_SBCU_EDAT_FPIDAT_OFF (0u)

/** \brief  Length for Ifx_SBCU_ID_Bits.MOD_REV */
#define IFX_SBCU_ID_MOD_REV_LEN (8u)

/** \brief  Mask for Ifx_SBCU_ID_Bits.MOD_REV */
#define IFX_SBCU_ID_MOD_REV_MSK (0xffu)

/** \brief  Offset for Ifx_SBCU_ID_Bits.MOD_REV */
#define IFX_SBCU_ID_MOD_REV_OFF (0u)

/** \brief  Length for Ifx_SBCU_ID_Bits.MODNUMBER */
#define IFX_SBCU_ID_MODNUMBER_LEN (8u)

/** \brief  Mask for Ifx_SBCU_ID_Bits.MODNUMBER */
#define IFX_SBCU_ID_MODNUMBER_MSK (0xffu)

/** \brief  Offset for Ifx_SBCU_ID_Bits.MODNUMBER */
#define IFX_SBCU_ID_MODNUMBER_OFF (8u)

/** \brief  Length for Ifx_SBCU_PRIOH_Bits.CPU1 */
#define IFX_SBCU_PRIOH_CPU1_LEN (4u)

/** \brief  Mask for Ifx_SBCU_PRIOH_Bits.CPU1 */
#define IFX_SBCU_PRIOH_CPU1_MSK (0xfu)

/** \brief  Offset for Ifx_SBCU_PRIOH_Bits.CPU1 */
#define IFX_SBCU_PRIOH_CPU1_OFF (0u)

/** \brief  Length for Ifx_SBCU_PRIOH_Bits.CPU2 */
#define IFX_SBCU_PRIOH_CPU2_LEN (4u)

/** \brief  Mask for Ifx_SBCU_PRIOH_Bits.CPU2 */
#define IFX_SBCU_PRIOH_CPU2_MSK (0xfu)

/** \brief  Offset for Ifx_SBCU_PRIOH_Bits.CPU2 */
#define IFX_SBCU_PRIOH_CPU2_OFF (4u)

/** \brief  Length for Ifx_SBCU_PRIOH_Bits.DMAL */
#define IFX_SBCU_PRIOH_DMAL_LEN (4u)

/** \brief  Mask for Ifx_SBCU_PRIOH_Bits.DMAL */
#define IFX_SBCU_PRIOH_DMAL_MSK (0xfu)

/** \brief  Offset for Ifx_SBCU_PRIOH_Bits.DMAL */
#define IFX_SBCU_PRIOH_DMAL_OFF (28u)

/** \brief  Length for Ifx_SBCU_PRIOH_Bits.HSMCMI */
#define IFX_SBCU_PRIOH_HSMCMI_LEN (4u)

/** \brief  Mask for Ifx_SBCU_PRIOH_Bits.HSMCMI */
#define IFX_SBCU_PRIOH_HSMCMI_MSK (0xfu)

/** \brief  Offset for Ifx_SBCU_PRIOH_Bits.HSMCMI */
#define IFX_SBCU_PRIOH_HSMCMI_OFF (20u)

/** \brief  Length for Ifx_SBCU_PRIOH_Bits.HSMRMI */
#define IFX_SBCU_PRIOH_HSMRMI_LEN (4u)

/** \brief  Mask for Ifx_SBCU_PRIOH_Bits.HSMRMI */
#define IFX_SBCU_PRIOH_HSMRMI_MSK (0xfu)

/** \brief  Offset for Ifx_SBCU_PRIOH_Bits.HSMRMI */
#define IFX_SBCU_PRIOH_HSMRMI_OFF (16u)

/** \brief  Length for Ifx_SBCU_PRIOH_Bits.RESERVEDA */
#define IFX_SBCU_PRIOH_RESERVEDA_LEN (4u)

/** \brief  Mask for Ifx_SBCU_PRIOH_Bits.RESERVEDA */
#define IFX_SBCU_PRIOH_RESERVEDA_MSK (0xfu)

/** \brief  Offset for Ifx_SBCU_PRIOH_Bits.RESERVEDA */
#define IFX_SBCU_PRIOH_RESERVEDA_OFF (8u)

/** \brief  Length for Ifx_SBCU_PRIOH_Bits.RESERVEDB */
#define IFX_SBCU_PRIOH_RESERVEDB_LEN (4u)

/** \brief  Mask for Ifx_SBCU_PRIOH_Bits.RESERVEDB */
#define IFX_SBCU_PRIOH_RESERVEDB_MSK (0xfu)

/** \brief  Offset for Ifx_SBCU_PRIOH_Bits.RESERVEDB */
#define IFX_SBCU_PRIOH_RESERVEDB_OFF (12u)

/** \brief  Length for Ifx_SBCU_PRIOH_Bits.RESERVEDE */
#define IFX_SBCU_PRIOH_RESERVEDE_LEN (4u)

/** \brief  Mask for Ifx_SBCU_PRIOH_Bits.RESERVEDE */
#define IFX_SBCU_PRIOH_RESERVEDE_MSK (0xfu)

/** \brief  Offset for Ifx_SBCU_PRIOH_Bits.RESERVEDE */
#define IFX_SBCU_PRIOH_RESERVEDE_OFF (24u)

/** \brief  Length for Ifx_SBCU_PRIOL_Bits.CPU0 */
#define IFX_SBCU_PRIOL_CPU0_LEN (4u)

/** \brief  Mask for Ifx_SBCU_PRIOL_Bits.CPU0 */
#define IFX_SBCU_PRIOL_CPU0_MSK (0xfu)

/** \brief  Offset for Ifx_SBCU_PRIOL_Bits.CPU0 */
#define IFX_SBCU_PRIOL_CPU0_OFF (28u)

/** \brief  Length for Ifx_SBCU_PRIOL_Bits.DMAH */
#define IFX_SBCU_PRIOL_DMAH_LEN (4u)

/** \brief  Mask for Ifx_SBCU_PRIOL_Bits.DMAH */
#define IFX_SBCU_PRIOL_DMAH_MSK (0xfu)

/** \brief  Offset for Ifx_SBCU_PRIOL_Bits.DMAH */
#define IFX_SBCU_PRIOL_DMAH_OFF (0u)

/** \brief  Length for Ifx_SBCU_PRIOL_Bits.DMAM */
#define IFX_SBCU_PRIOL_DMAM_LEN (4u)

/** \brief  Mask for Ifx_SBCU_PRIOL_Bits.DMAM */
#define IFX_SBCU_PRIOL_DMAM_MSK (0xfu)

/** \brief  Offset for Ifx_SBCU_PRIOL_Bits.DMAM */
#define IFX_SBCU_PRIOL_DMAM_OFF (20u)

/** \brief  Length for Ifx_SBCU_PRIOL_Bits.ETH */
#define IFX_SBCU_PRIOL_ETH_LEN (4u)

/** \brief  Mask for Ifx_SBCU_PRIOL_Bits.ETH */
#define IFX_SBCU_PRIOL_ETH_MSK (0xfu)

/** \brief  Offset for Ifx_SBCU_PRIOL_Bits.ETH */
#define IFX_SBCU_PRIOL_ETH_OFF (8u)

/** \brief  Length for Ifx_SBCU_PRIOL_Bits.HSSL */
#define IFX_SBCU_PRIOL_HSSL_LEN (4u)

/** \brief  Mask for Ifx_SBCU_PRIOL_Bits.HSSL */
#define IFX_SBCU_PRIOL_HSSL_MSK (0xfu)

/** \brief  Offset for Ifx_SBCU_PRIOL_Bits.HSSL */
#define IFX_SBCU_PRIOL_HSSL_OFF (12u)

/** \brief  Length for Ifx_SBCU_PRIOL_Bits.RESERVED1 */
#define IFX_SBCU_PRIOL_RESERVED1_LEN (4u)

/** \brief  Mask for Ifx_SBCU_PRIOL_Bits.RESERVED1 */
#define IFX_SBCU_PRIOL_RESERVED1_MSK (0xfu)

/** \brief  Offset for Ifx_SBCU_PRIOL_Bits.RESERVED1 */
#define IFX_SBCU_PRIOL_RESERVED1_OFF (4u)

/** \brief  Length for Ifx_SBCU_PRIOL_Bits.RESERVED4 */
#define IFX_SBCU_PRIOL_RESERVED4_LEN (4u)

/** \brief  Mask for Ifx_SBCU_PRIOL_Bits.RESERVED4 */
#define IFX_SBCU_PRIOL_RESERVED4_MSK (0xfu)

/** \brief  Offset for Ifx_SBCU_PRIOL_Bits.RESERVED4 */
#define IFX_SBCU_PRIOL_RESERVED4_OFF (16u)

/** \brief  Length for Ifx_SBCU_PRIOL_Bits.RESERVED6 */
#define IFX_SBCU_PRIOL_RESERVED6_LEN (4u)

/** \brief  Mask for Ifx_SBCU_PRIOL_Bits.RESERVED6 */
#define IFX_SBCU_PRIOL_RESERVED6_MSK (0xfu)

/** \brief  Offset for Ifx_SBCU_PRIOL_Bits.RESERVED6 */
#define IFX_SBCU_PRIOL_RESERVED6_OFF (24u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXSBCU_BF_H */
